app/views/dishes/_form.html.erb

SELECT "restaurants".* FROM "restaurants"
---
    <label>Restaurante</label>
    <%= form.select :restaurant_id, Restaurant.all.collect {|restaurant| [restaurant.name, restaurant.id]}, :class => "form-control" %>

SELECT "categories".* FROM "categories"
---
    <label>Categoria</label>
    <%= form.select :category_id, Category.all.collect {|category| [category.name, category.id]}, :class => "form-control" %>

SELECT "ingredients".* FROM "ingredients" INNER JOIN "dishes_ingredients" ON "ingredients"."id" = "dishes_ingredients"."ingredient_id" WHERE "dishes_ingredients"."dish_id" = $1  [["dish_id", 1]]
---
    <label>Ingredientes</label><br>
    <%= form.collection_check_boxes(:ingredient_ids, Ingredient.all, :id, :description, checked: dish.ingredients.map(&:id)) do |i| %>