app/views/dishes/index.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "dishes_ingredients" ON "ingredients"."id" = "dishes_ingredients"."ingredient_id" WHERE "dishes_ingredients"."dish_id" = $1  [["dish_id", 1]]
---
        <td><%= dish.category.name %></td>
        <td><%= dish.ingredients.map(&:description).join(', ') %></td>