app/controllers/dishes_controller.rb

INSERT INTO "dishes" ("description", "price", "time", "created_at", "updated_at", "restaurant_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_dish
      @dish = Dish.find(params[:id])