app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
SELECT DISTINCT "restaurants".* FROM "restaurants" INNER JOIN dishes ON dishes.restaurant_id = restaurants.id AND dishes.category_id = 1
---
  def homepage
    @restaurants = Restaurant.all
    @restaurants = @restaurants.joins("INNER JOIN dishes ON dishes.restaurant_id = restaurants.id AND dishes.category_id = ", params[:category_id]).distinct unless params[:category_id].blank?

INSERT INTO "restaurants" ("name", "address", "telephone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Restaurante Mexicano"], ["address", "Rua Do Sombreiro"], ["telephone", "34 9999 3434"], ["created_at", "2018-05-17 07:27:20.146105"], ["updated_at", "2018-05-17 07:27:20.146105"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save